#Область ОбработчикиСобытий

// Формирует приходные движения по регистру ОстаткиТоваров при проведении документа.
Процедура ОбработкаПроведения(Отказ, Режим)

	// Подготавливаем движения регистра остатков.
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();

	// Подготавливаем движения оборотного регистра.
	Движения.ОборотыТоваров.Записывать = Истина;
	Движения.ОборотыТоваров.Очистить();

	Для Каждого СтрокаТоваров Из Товары Цикл

		// Увеличиваем остаток товара.
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = СтрокаТоваров.Товар;
		Движение.Количество = СтрокаТоваров.Количество;

		// Учитываем поступившее количество в оборотах.
		ДвижениеОбороты = Движения.ОборотыТоваров.Добавить();
		ДвижениеОбороты.Период = Дата;
		ДвижениеОбороты.Товар = СтрокаТоваров.Товар;
		ДвижениеОбороты.КоличествоПоступило = СтрокаТоваров.Количество;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти